spec/support/fixtures/request/cancel_order/non_cancelable.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="urn:SSC_EVoucher" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><authentication><username>CG12345678</username><password>CG34fewr4</password></authentication></env:Header><env:Body><tns:CreateOrder><RetailerID>775001393</RetailerID><ProductID>H0204</ProductID><TerminalID>93880010</TerminalID><NrOfVouchers>1</NrOfVouchers><Reference></Reference><IsCancelable>false</IsCancelable><AutoConfirm>false</AutoConfirm></tns:CreateOrder></env:Body></env:Envelope>
